
/*
문제 설명
문자열 phone_number가 주어집니다.
전화번호는 다음 세 가지 형식 중 하나일 수 있습니다.
- 1유형: 010xxxxxxxx
- 2유형: 010-xxxx-xxxx
- 3유형: +82-10-xxxx-xxxx
phone_number가 정확히 하나의 유형에 해당한다면 해당 유형의 번호 1, 2, 3을 반환하세요.
어느 유형에도 해당하지 않으면 -1을 반환하세요.
문자열의 일부만 형식에 해당하는 경우에는 올바른 전화번호로 인정하지 않습니다.

제한사항
- phone_number의 길이는 1 이상 30 이하입니다.
- phone_number는 숫자와 +, - 문자로 구성될 수 있습니다.

입출력 예시
phone_number	        result
"01011112222"	        1
"010-1111-2222"	        2
"+82-10-1111-2222"	    3
"010-1111-333"	        -1
"+82-010-1111-4444"	    -1
*/

function solution(phone_number) {
    const type1 = /^010\d{8}$/;
    const type2 = /^010-\d{4}-\d{4}$/;
    const type3 = /^\+82-10-\d{4}-\d{4}$/;

    if (type1.test(phone)) return 1;
    if (type2.test(phone)) return 2;
    if (type3.test(phone)) return 3;

    return -1;
}

/*
    1. / ... / → 정규식 시작과 끝
    2. ^ → 문자열의 시작
    3. 010 → 반드시 010으로 시작
    4. \d → 숫자 1자리
    5. {8} → 바로 앞의 \d가 8번
    6. $ → 문자열의 끝
    7. test()는 이 문자열이 정규식 패턴과 맞는지 검사하는 함수

    const type1 = /^010\d{8}$/; 
        -> 010 + 숫자 8자리
    const type2 = /^010-\d{4}-\d{4}$/;
        -> 010-숫자4자리-숫자4자리
    const type3 = /^\+82-10-\d{4}-\d{4}$/;
        -> 정규식에서 +는 원래 특별한 의미를 가진 문자라서, 진짜 + 자체를 찾으려면 앞에 \를 붙여야 함
        -> +82-10-숫자4자리-숫자4자리

    예시)
        const pattern = /^010\d{8}$/;

        pattern.test("01012345678");
        // true
        pattern.test("010-1234-5678");
        // false
*/